Autodesk.Revit.DB.Electrical.ElectricalPhase
An enumerated type to specify whether the electrical system is single phase or three phase.

Autodesk.Revit.DB.Electrical.ElectricalPhase.ThreePhase
Electrical phase is three phase.

Autodesk.Revit.DB.Electrical.ElectricalPhase.SinglePhase
Electrical phase is single phase.